const OfferDetails = () => {
  return (
    <div className="card lg:p-8 space-y-4 lg:space-y-8">
      <h3 className="text-lg lg:text-2xl font-bold">وصف العرض</h3>

      <div className="p-4 bg-accent rounded-2xl">
        حساب GTA 5 مودد – 1 مليون + 50+ سيارة حساب PC Enhanced جاهز للعب فورًا
        أكثر من 1 مليون دولار داخل اللعبة 50+ سيارة مودد نادرة ومميزة رانك عالي
        + جميع الأسلحة مفتوحة حماية TradeShield كاملة ضد الباند تسليم فوري خلال
        دقايق بعد الدفع دعم 24/7 لو في أي استفسار اشترِ الآن وابدأ اللعب بقوة
        كاملة! (تحت النص حطي 4 خيارات صغيرة زي في الصورة: حساب GTA 5 مودد – 500
        مليون | حساب GTA 5 مودد – 1 مليار | حساب GTA 5 مودد – 2 مليار | حساب GTA
        5 مودد – 5 مليار)
      </div>

      <div className="p-4 bg-accent rounded-2xl">
        حساب GTA 5 مودد – 1 مليون + 50+ سيارة حساب PC Enhanced جاهز للعب فورًا
        أكثر من 1 مليون دولار داخل اللعبة 50+ سيارة مودد نادرة ومميزة رانك عالي
        + جميع الأسلحة مفتوحة حماية TradeShield كاملة ضد الباند تسليم فوري خلال
        دقايق بعد الدفع دعم 24/7 لو في أي استفسار اشترِ الآن وابدأ اللعب بقوة
        كاملة! (تحت النص حطي 4 خيارات صغيرة زي في الصورة: حساب GTA 5 مودد – 500
        مليون | حساب GTA 5 مودد – 1 مليار | حساب GTA 5 مودد – 2 مليار | حساب GTA
        5 مودد – 5 مليار)
      </div>
    </div>
  );
};

export default OfferDetails;
